tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "teamookla/speedtest"
brew "openssl@3"
brew "automake"
brew "bash"
brew "bash-completion@2"
brew "btop"
brew "curl"
brew "django-completion"
brew "ffmpeg"
brew "gdbm"
brew "gh"
brew "git"
brew "python@3.12"
brew "git-lfs"
brew "jq"
brew "nano"
brew "node"
brew "pandoc"
brew "pipenv"
brew "poetry"
brew "postgresql@15", restart_service: true
brew "ruby"
brew "shellcheck"
brew "shfmt"
brew "tmux"
brew "tree"
brew "yarn"
cask "appcleaner"
cask "bbedit"
cask "docker"
cask "fetch"
cask "firefox"
cask "github"
cask "google-chrome"
cask "imageoptim"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "microsoft-word"
cask "obsidian"
cask "onyx"
cask "signal"
cask "visual-studio-code"
cask "zoom"
vscode "bierner.emojisense"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-preview-github-styles"
vscode "budparr.language-hugo-vscode"
vscode "charliermarsh.ruff"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "DeepInThought.vscode-shell-snippets"
vscode "EditorConfig.EditorConfig"
vscode "foxundermoon.shell-format"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "timonwong.shellcheck"
vscode "WakaTime.vscode-wakatime"
vscode "xabikos.JavaScriptSnippets"
vscode "yzhang.markdown-all-in-one"
